app/controllers/todo_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 4]]
---
    def show
        @t=Todo.find(params[:id])

INSERT INTO "todos" ("description", "pomodoro_estimate", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Press F"], ["pomodoro_estimate", 1], ["completed", "f"], ["created_at", "2018-08-19 18:25:36.732413"], ["updated_at", "2018-08-19 18:25:36.732413"]]
---
    def create
        t=Todo.new
        t.description=params[:description]
        t.pomodoro_estimate=params[:pomodoro_estimate]
        t.completed=false
        t.save

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 7]]
---
    def destroy
        @t=Todo.destroy(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 11]]
---
    def edit
        @t=Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "todos" SET "description" = $1, "pomodoro_estimate" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["description", "Rock like a guitar"], ["pomodoro_estimate", 19111191], ["updated_at", "2018-08-19 21:21:21.108311"], ["id", 13]]
---
    def update
        t=Todo.find(params[:id])
        t.description=params[:description]
        t.pomodoro_estimate=params[:pomodoro_estimate]
        t.completed=false
        t.save