app/controllers/todo_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", nil]]
---
    def delete
        todo_delete=Todo.find(params[:id])